"""2. Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
Ваша задача — вывести дату в текстовом виде, например: второе ноября 2013 года.
Склонением пренебречь (2000 года, 2010 года)"""

# d=str(input())
date = "10.11.1980"

[dd0, mm0, yyyy0] = date.split(".")

dd = str()  # dd - строковое обозначение числа даты
mm = str()  # mm - строкове обозначение месяца даты
if dd0 == "10":
    dd = "десятое"
if dd0 == "11":
    dd = "одинадцатое"
if dd0 == "12":
    dd = "двенадцатое"
if dd0 == "13":
    dd = "тринадцатое"
if dd0 == "14":
    dd = "четырнадцатое"
if dd0 == "15":
    dd = "пятнадцатое"
if dd0 == "16":
    dd = "шестнадцатое"
if dd0 == "17":
    dd = "семнадцатое"
if dd0 == "18":
    dd = "восемнадцатое"
if dd0 == "19":
    dd = "десятнадцатое"

ddn = int(dd0)
if (ddn > 20):
    dd = "двадцать "
if (ddn > 30):
    dd = "тридцать "
if dd0 == "20":
    dd = "двадцатое"
if dd0 == "30":
    dd = "тридцатое"

if (ddn % 10 == 1):
    dd = dd + "первое"
if (ddn % 10 == 2):
    dd = dd + "второе"
if (ddn % 10 == 3):
    dd = dd + "третье"
if (ddn % 10 == 4):
    dd = dd + "четвертое"
if (ddn % 10 == 5):
    dd = dd + "пятое"
if (ddn % 10 == 6):
    dd = dd + "шестое"
if (ddn % 10 == 7):
    dd = dd + "седьмое"
if (ddn % 10 == 8):
    dd = dd + "восьмое"
if (ddn % 10 == 9):
    dd = dd + "девятое"

if mm0 == "01":
    mm = "января"
if mm0 == "02":
    mm = "февраля"
if mm0 == "03":
    mm = "марта"
if mm0 == "04":
    mm = "апреля"
if mm0 == "05":
    mm = "мая"
if mm0 == "06":
    mm = "июня"
if mm0 == "07":
    mm = "июля"
if mm0 == "08":
    mm = "августа"
if mm0 == "09":
    mm = "сентября"
if mm0 == "10":
    mm = "октября"
if mm0 == "11":
    mm = "ноября"
if mm0 == "12":
    mm = "декабря"


print(dd,mm,yyyy0,"года")
# print(dd,mm,yyyy)
# print(dd,mm,yyyy)
